; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	Star5 - direction
	Star6 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star7 - direction
	Star4 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(pointing satellite0 Planet15)
	(have_image Star10 thermograph0)
	(have_image Star11 image1)
	(have_image Star12 thermograph0)
	(have_image Planet13 thermograph0)
	(have_image Planet14 thermograph2)
	(have_image Planet15 thermograph2)
	(have_image Star16 thermograph0)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 thermograph2)
))

)

; plan
1. (turn_to satellite0 groundstation2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 star12 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star12)
   goals met: 0 of 10
5. (take_image satellite0 star12 instrument1 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 1 of 10
6. (turn_to satellite0 star10 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star10)
   goals met: 1 of 10
7. (take_image satellite0 star10 instrument1 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 2 of 10
8. (turn_to satellite0 planet13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet13)
   goals met: 2 of 10
9. (take_image satellite0 planet13 instrument1 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon17 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon17 instrument1 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 4 of 10
12. (turn_to satellite0 star16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star16)
   goals met: 4 of 10
13. (take_image satellite0 star16 instrument1 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 5 of 10
14. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 5 of 10
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 10
16. (turn_to satellite0 groundstation3 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation3)
   goals met: 5 of 10
17. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 5 of 10
18. (turn_to satellite0 planet14 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet14)
   goals met: 5 of 10
19. (take_image satellite0 planet14 instrument0 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 6 of 10
20. (turn_to satellite0 planet18 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet18)
   goals met: 6 of 10
21. (take_image satellite0 planet18 instrument0 thermograph2)
   added: (have_image planet18 thermograph2)
   goals met: 7 of 10
22. (turn_to satellite0 star11 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star11)
   goals met: 7 of 10
23. (take_image satellite0 star11 instrument0 image1)
   added: (have_image star11 image1)
   goals met: 8 of 10
24. (turn_to satellite0 planet15 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet15)
   goals met: 9 of 10
25. (take_image satellite0 planet15 instrument0 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 10 of 10
